In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [7]:
dframe= DataFrame({'k1':['X','X','Y','Y','Z'],
                  'k2':['alpha','beta','alpha','beta','alpha'],
                  'dataset1':np.random.randn(5),
                  'dataset2':np.random.randn(5)})

In [8]:
dframe

   dataset1  dataset2 k1     k2
0 -0.404114  0.441651  X  alpha
1  0.329163 -1.578292  X   beta
2 -1.660877  0.460587  Y  alpha
3 -0.009294  0.491975  Y   beta
4  0.450450 -1.596563  Z  alpha

In [12]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [13]:
group1

In [15]:
group1.mean()

k1
X   -0.037475
Y   -0.835086
Z    0.450450
Name: dataset1, dtype: float64

In [16]:
cities =np.array(['NY','LA','LA','NY','NY'])
month =np.array(['JAN','FEB','JAN','FEB','JAN'])

In [17]:
dframe

   dataset1  dataset2 k1     k2
0 -0.404114  0.441651  X  alpha
1  0.329163 -1.578292  X   beta
2 -1.660877  0.460587  Y  alpha
3 -0.009294  0.491975  Y   beta
4  0.450450 -1.596563  Z  alpha

In [18]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    0.329163
    JAN   -1.660877
NY  FEB   -0.009294
    JAN    0.023168
Name: dataset1, dtype: float64

In [19]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.037475 -0.568320
Y  -0.835086  0.476281
Z   0.450450 -1.596563

In [20]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.404114  0.441651
   beta   0.329163 -1.578292
Y  alpha -1.660877  0.460587
   beta  -0.009294  0.491975
Z  alpha  0.450450 -1.596563

In [21]:
dframe.groupby('k1').std()

    dataset1  dataset2
k1
X   0.518505  1.428315
Y   1.167846  0.022194
Z        NaN       NaN

In [22]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

In [27]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.441651
   beta  -1.578292
Y  alpha  0.460587
   beta   0.491975
Z  alpha -1.596563

In [29]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [30]:
for name,group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
   dataset1  dataset2 k1     k2
0 -0.404114  0.441651  X  alpha
1  0.329163 -1.578292  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2 -1.660877  0.460587  Y  alpha
3 -0.009294  0.491975  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4   0.45045 -1.596563  Z  alpha

In [31]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print('Key1 ={} Key2={}'.format(k1,k2))
    print(group)
    print('\n')

Key1 =X Key2=alpha
   dataset1  dataset2 k1     k2
0 -0.404114  0.441651  X  alpha


Key1 =X Key2=beta
   dataset1  dataset2 k1    k2
1  0.329163 -1.578292  X  beta


Key1 =Y Key2=alpha
   dataset1  dataset2 k1     k2
2 -1.660877  0.460587  Y  alpha


Key1 =Y Key2=beta
   dataset1  dataset2 k1    k2
3 -0.009294  0.491975  Y  beta


Key1 =Z Key2=alpha
   dataset1  dataset2 k1     k2
4   0.45045 -1.596563  Z  alpha

In [32]:
gr =dframe.groupby('k1')

In [34]:
gr.get_group('X')

   dataset1  dataset2 k1     k2
0 -0.404114  0.441651  X  alpha
1  0.329163 -1.578292  X   beta

In [35]:
group_dict =dict(list(dframe.groupby('k1')))

In [36]:
group_dict['X']

   dataset1  dataset2 k1     k2
0 -0.404114  0.441651  X  alpha
1  0.329163 -1.578292  X   beta

In [37]:
group_dict_axis1 =dict(list(dframe.groupby(dframe.dtypes,axis=1)))

In [38]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -0.404114  0.441651
 1  0.329163 -1.578292
 2 -1.660877  0.460587
 3 -0.009294  0.491975
 4  0.450450 -1.596563, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}